# 04 - Pandas - Processamento e Análise de Dados
## Aula 11 - 15 - Pandas - Removendo linhas e colunas do Dataframe

## Professor: Orlando Oliveira dos Santos, MsC.
 - E-mail: professor.orlando.santos@gmail.com 
 - Youtube :https://www.youtube.com/channel/UCPWWbkPWFmOjXH50TQWNAYg
 - Linkedin: https://linkedin.com/in/orlandoosantos
 - Facebook: https://www.facebook.com/proforlandosantosmsc/
 - Twitter: https://twitter.com/ProfOrlandoMsC
 - Instagram: https://www.instagram.com/proforlandosantosmsc/

## Formação Acadêmica
- Mestrado em Computação Aplicada - UnB (2014 – 2016)	
- MBA, Administração Estratégica de Sistemas de Informação – FGV (2011 – 2013)
- Tecnólogo em Processamento de Dados, Análise e Desenvolvimento de Sistemas – FAETEC/SP (2000-2002)

# Pandas - Removendo linhas e colunas do Dataframe

## Descartando rótulos de um eixo 
A função drop() remove um conjunto de rótulos de um eixo:

In [1]:
import numpy as np
import pandas as pd
df = pd.read_csv('./content/totaisestadoscomregiao_arr.csv', sep=';',names =['REGIAO', 'UF', 'CASOS','OBITOS'], index_col=False)
df.head()

         REGIAO  UF   CASOS  OBITOS
0  Centro-Oeste  DF  221526    3845
1  Centro-Oeste  GO  269857    6107
2  Centro-Oeste  MS   89654    1699
3  Centro-Oeste  MT  152968    4009
4      Nordeste  AL   92951    2304

In [2]:
df.drop([1,2,3,4,5,6,7,8,9], axis=0).head()

          REGIAO  UF   CASOS  OBITOS
0   Centro-Oeste  DF  221526    3845
10      Nordeste  PI  120913    2554
11      Nordeste  RN   84381    2649
12      Nordeste  SE   86361    2266
13         Norte  AC   33725     709

In [3]:
df.drop(['REGIAO', 'CASOS'], axis=1).head()

   UF  OBITOS
0  DF    3845
1  GO    6107
2  MS    1699
3  MT    4009
4  AL    2304